## Plan Result (nonprod_general - TerraformPlanApply)




<pre><code>Plan: 4 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_private_dns_zone_virtual_network_link.postgres_dns_zone_vnet_link
  * module.networking.azurerm_network_security_rule.rules[&#34;atlassian-int-subnet-app-nsg-postgres_private&#34;]
  * module.networking.azurerm_network_security_rule.rules[&#34;atlassian-int-subnet-dat-nsg-postgres_private&#34;]
  * module.networking.azurerm_network_security_rule.rules[&#34;atlassian-int-subnet-ops-nsg-postgres_private&#34;]
* Update
  * azurerm_application_gateway.ag
  * azurerm_postgresql_server.atlassian-server
  * azurerm_private_endpoint.postgres_private_endpoint
  * module.networking.azurerm_network_security_rule.rules[&#34;atlassian-int-subnet-app-nsg-postgres_outbound&#34;]
  * module.networking.azurerm_network_security_rule.rules[&#34;atlassian-int-subnet-dat-nsg-postgres_outbound&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                              = "atlassian-nonprod-server"
      ~ tags                              = {
          - "application"  = "atlassian" -> null
          - "builtFrom"    = "hmcts/atlassian-infrastructure" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_private_dns_zone_virtual_network_link.postgres_dns_zone_vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgres_dns_zone_vnet_link" {
      + id                    = (known after apply)
      + name                  = "atlassian-nonprod-postgres-dns-vnet-link"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + virtual_network_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet"
    }

  # azurerm_private_endpoint.postgres_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "postgres_private_endpoint" {
        id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-nonprod-postgres-pe"
        name                          = "atlassian-nonprod-postgres-pe"
      ~ tags                          = {
          - "application"  = "atlassian" -> null
          - "builtFrom"    = "hmcts/atlassian-infrastructure" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.networking.azurerm_network_security_rule.rules["atlassian-int-subnet-app-nsg-postgres_outbound"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
      ~ access                                     = "Allow" -> "Deny"
        id                                         = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-app-nsg-nonprod/securityRules/postgres_outbound"
        name                                       = "postgres_outbound"
        # (16 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_rule.rules["atlassian-int-subnet-app-nsg-postgres_private"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.4.0/26"
      + destination_port_range      = "5432"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "postgres_private"
      + network_security_group_name = "atlassian-networking-atlassian-int-subnet-app-nsg-nonprod"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "atlassian-nonprod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.rules["atlassian-int-subnet-dat-nsg-postgres_outbound"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
      ~ access                                     = "Allow" -> "Deny"
        id                                         = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-dat-nsg-nonprod/securityRules/postgres_outbound"
        name                                       = "postgres_outbound"
        # (16 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_rule.rules["atlassian-int-subnet-dat-nsg-postgres_private"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.4.0/26"
      + destination_port_range      = "5432"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "postgres_private"
      + network_security_group_name = "atlassian-networking-atlassian-int-subnet-dat-nsg-nonprod"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "atlassian-nonprod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.rules["atlassian-int-subnet-ops-nsg-postgres_private"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.4.0/26"
      + destination_port_range      = "5432"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "postgres_private"
      + network_security_group_name = "atlassian-networking-atlassian-int-subnet-ops-nsg-nonprod"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "atlassian-nonprod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

Plan: 4 to add, 5 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":29,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->